# parameters
nc: 80  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

# anchors
anchors:
  - [30,61, 62,45, 59,119] # P4/16

backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64,3,1]], # 0
  [-1, 1, Conv,[64,3,2]],  # 1-P1/2
  # [[-1, 1, Conv, [32,3,1]], # 0
  # [-1, 1,Conv,[32,3,2]],  # 1-P1/2
   [-1, 1, Conv, [64,3,1]], # 2
   [-1, 1, Conv,[64,3,2]],
   [-1, 1, Conv, [128,3,1]],
   [-1, 1, Conv, [64,1,1]],
   [-1, 1, Conv, [128,3,1]],
   [-1, 1, Conv,[128,3,2]],
   [-1, 1, Conv, [256,3,1]],
   [-1, 1, Conv, [128,1,1]],
   [-1, 1, Conv, [256,3,1]],
   [-1, 1, Conv,[256,3,2]],
   [-1, 1, Conv, [512,3,1]],
   [-1, 1, Conv, [256,1,1]],
   [-1, 1, Conv, [512,3,1]],
   [-1, 1, Conv, [256,1,1]],
   [-1, 1, Conv, [512,3,1]],
   [-1, 1, Conv,[512,3,2]],
   [-1, 1, Conv, [1024,3,1]],
   [-1, 1, Conv, [512,1,1]],
   [-1, 1, Conv, [1024,3,1]],
   [-1, 1, Conv, [512,1,1]],
   [-1, 1, Conv, [1024,3,1]],
  ]

head:
  [[-1, 1, Conv, [1024, 3, 1]],
   [-1, 1, Conv, [1024, 3, 1]],
   [-1, 1, Conv, [1024, 3, 1]], # 25 (p5)
   [[25], 1, Detect, [nc, anchors]], # Detect(P5)
  ]


